trade_exp/src/Catalogs/КартыЛояльности/КартыЛояльности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КартыЛояльности</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.ВидыКартЛояльности</owners>
  <attributes>
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>МагнитныйКод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Enums/СтатусыКартЛояльности/СтатусыКартЛояльности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыКартЛояльности</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="f1baa0f1-c6c0-430d-90f6-7d9027b50b0a">
    <name>Аннулирована</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b6d3dd02-b8c3-47f2-a86f-e222d2841283">
    <name>Действует</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Партнеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НашеПредприятие</name>
      <description>Наше предприятие</description>
    </items>
  </predefined>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БонуснаяПрограммаАктивна</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>МАП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаАктивацииБонуснойПрограммы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПИН_Код</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a2d8cff6-485d-4179-8e9c-c0e74d4f7704">
    <name>АктивнаяФаза</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4ed10a1b-4743-4b2e-b332-43a49c33d53a">
    <name>ОбъемСтроительства</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6d937f9b-c6c0-400a-a976-e17d07dc2cf4">
    <name>ДатаНачалаАктивнойФазы</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ab7b5f85-1360-48d2-9266-6d9b809fa216">
    <name>НормативПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПодтвержденияНомераТелефона</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНомераТелефона</name>
    <type>
      <types>EnumRef.СостояниеНомераТелефона</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодовойОборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="63694e17-0adb-4a8a-afea-e4e7735edfc1">
    <name>СоглашениеДляРассылок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf121ead-3982-46d0-bcce-a08413595a1f">
    <name>Парсинг</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="59343292-e18c-4609-a039-11cc8d8cd93a">
    <name>ВидыНоменклатурыАктивнойФазы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="eeb4daa7-609a-4968-8745-1b6125400c0b">
      <name>ВидНоменклатуры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6f09dd5d-7de9-4a21-a839-9674c6120b36">
      <name>Коэффициент</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e8a1213f-80cf-4cf1-866d-59ee4fa4ffbe">
      <name>ЭтапСтроительства</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="0daacbf9-aa02-4485-a535-d2d28b00523c">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="8667b665-ede0-456e-ad08-51f4cf43503a">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6203050a-d3b4-4e82-89f7-5ad54cf4906b">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3b79728c-4ce5-4330-b398-b32f0bb3e6d5">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b9e943c2-8fad-47c5-b878-66f2576cc609">
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2ac6cdc9-f345-456a-9bd8-2e5ae5af6f56">
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="6245a898-0f24-4b85-b2d7-89831867e9d9">
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9d10a2ad-841d-4931-902b-83db2a08aaaa">
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="2acd53d1-e5ab-4fe9-8341-24b714c87f11">
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e30e3544-d00d-4269-ac29-88451a763262">
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="675d6c69-31a6-49c2-a9b2-cc82f578bbeb">
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ce03862f-daeb-4d43-a69d-c989cd1f6089">
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="72399ba5-bcbe-40be-b76e-ff36467bc65d">
      <name>ВидДляСписка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="df571c83-e6f9-459f-abbc-6e6053e6eb48">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Catalogs/КартыЛояльности/Forms/СчитываниеКартыЛояльности/Module.bsl
&НаСервере
Функция Спр_ПоискПослеНаСервере()
	
	//НомерТелефона = СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("()- ", НомерТелефона, "");
	АльтерраОбщегоНазначения.ПривестиКФорматуНомерТелефона(НомерТелефона);
	
	Если Не ЗначениеЗаполнено(НомерТелефона) ИЛИ СтрДлина(НомерТелефона)<>10 Тогда
		Отказ = Истина;
		Возврат Ложь;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	// - Альтерра
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ПартнерыКонтактнаяИнформация.Ссылка КАК Клиент
	//	|ИЗ
	//	|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	//	|ГДЕ
	//	|	ПартнерыКонтактнаяИнформация.НомерТелефона ПОДОБНО ""%"" + &НомерТелефона + ""%""";
	//-
	
	//+Альтерра
	Если ТипЗапроса = 0 Тогда
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПартнерыКонтактнаяИнформация.Ссылка КАК Клиент
		|ИЗ
		|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
		|ГДЕ
		|	ПартнерыКонтактнаяИнформация.НомерТелефона ПОДОБНО ""%"" + &НомерТелефона + ""%""";
	Иначе	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПартнерыКонтактнаяИнформация.Ссылка КАК Клиент,
		|	""Клиенте"" КАК УказанВ
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
		|ГДЕ
		|	ПартнерыКонтактнаяИнформация.НомерТелефона ПОДОБНО ""%"" + &НомерТелефона + ""%""
		|	И ПартнерыКонтактнаяИнформация.Ссылка.ПометкаУдаления = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.Владелец,
		|   ""Контактном лице - "" + КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.Наименование КАК УказанВ
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
		|ГДЕ
		|	КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона ПОДОБНО ""%"" + &НомерТелефона + ""%""
		|	И КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ.Клиент КАК Клиент,
		|   ВТ.УказанВ КАК УказанВ
		|ИЗ
		|	ВТ КАК ВТ";
	КонецЕсли;
	//-
	
	
	Запрос.УстановитьПараметр("НомерТелефона", НомерТелефона);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()>0 Тогда
		НайденныеКлиенты.Загрузить(РезультатЗапроса);
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура Спр_ПоискПосле(Команда)
	Если Спр_ПоискПослеНаСервере() тогда 
		ЭтаФорма.Элементы.ГруппаНайденныеКлиенты.Видимость = Истина;
	Иначе
		Сообщить("Клиент не найден!Проверьте, пожалуйста, корректность ввода!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоискКартЛояльности(Получатель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КартыЛояльности.Ссылка КАК Ссылка,
		|	КартыЛояльности.Наименование КАК Наименование,
		|	КартыЛояльности.Статус КАК Статус
		|ИЗ
		|	Справочник.КартыЛояльности КАК КартыЛояльности
		|ГДЕ
		|	КартыЛояльности.Партнер = &Владелец
		|	И КартыЛояльности.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКартЛояльности.Действует)";
	
	Запрос.УстановитьПараметр("Владелец", Получатель);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	НайденныеКартыЛояльности.Загрузить(РезультатЗапроса);
		
КонецПроцедуры
&НаКлиенте
Процедура Спр_НайденныеКлиентыВыборПосле(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные= Элементы.НайденныеКлиенты.ТекущиеДанные;
	Закрыть();
	Оповестить(
	"СчитанПартнер",
	Новый Структура("Партнер, ФормаВладелец", ТекущиеДанные.Клиент, ВладелецФормы.УникальныйИдентификатор),
	Неопределено);
	 
	 //ПоказатьОповещениеПользователя(
	 //НСтр("ru = 'Считана партнер"),
	 //ПолучитьНавигационнуюСсылку(ТекущиеДанные.Клиент),
	 //СтрШаблон(НСтр("ru = 'Считана карта лояльности %1'"), ТекущиеДанные.Клиент),
	 //БиблиотекаКартинок.Информация32);
	
	 //ПоискКартЛояльности(Элемент.ТекущиеДанные.Клиент);
	 //СтэкСтраниц.Добавить(Элементы.Страницы.ТекущаяСтраница);
	 //Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаВыборКартыЛояльности;
	 //Элементы.СтраницыКнопкиНазад.ТекущаяСтраница = Элементы.СтраницыКнопкиНазад.ПодчиненныеЭлементы.КнопкаНазад;
 КонецПроцедуры

&НаСервере
 Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	 Если Параметры.Свойство("ТипЗапроса") Тогда
		 ТипЗапроса = Параметры.ТипЗапроса;
	 Иначе
		 ТипЗапроса = 0;
	КонецЕсли;		 
 КонецПроцедуры
